Revit 2027 API
MEPAnalyticalSegment.SetLossCoefficientOverride Method
 Sets the overridden value of loss coefficient.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLossCoefficientOverride(
	MEPAnalyticalModelData analyticalModel,
	double lossCoefficient
)
Public Sub SetLossCoefficientOverride (
	analyticalModel As MEPAnalyticalModelData,
	lossCoefficient As Double
)
public:
void SetLossCoefficientOverride(
	MEPAnalyticalModelData^ analyticalModel,
	double lossCoefficient
)
member SetLossCoefficientOverride :
        analyticalModel : MEPAnalyticalModelData *
        lossCoefficient : float -> unit
Parameters
analyticalModel MEPAnalyticalModelData
 The analytical model data that this segment belongs to.
lossCoefficient Double
 The new loss coefficient value, dimensionless.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace